import React from "react";
import img8 from "../images/img8.jpg";
import img9 from "../images/solve.jpg";
import img11 from "../images/img11.jpg";
import img12 from "../images/img12.jpg";
import img13 from "../images/img13.jpg";
import img14 from "../images/img14.png";
import Carousel from "react-bootstrap/Carousel";
import "./style.css";

const DentalServices = () => {
  return (
    <div className="allSlide">
      <Carousel>
        <Carousel.Item>
          <img className="slider" src={img8} alt="First slide" />
          <Carousel.Caption className="test2">
            <div className=" title">
              تحظى خدمات العلاج بالجامعة بتقدير عالٍ وتحظى بتقدير جيد ، مع
              تقييمات إيجابية من الزائرين الذين شرفونا في عيادات الجامعه لتقديم
              لهم أفضل الخدمات المتوفره لمعالجه أسنانهم. وأيضا توفر مجموعة واسعة
              من دعم لمساعدة الطلاب على النجاح أكاديميا وشخصيا
              <br /> ومن العيادات المتوفره و الخدمات المقدمة
            </div>

            <div className="text2 ar-f">
              <h4 className="fs-2 ar-f">عيادات الأطفال</h4>
              <p>
                ...تقديم كافة الخدمات العلاجية للاطفال من قلع الاسنان وتسوس
                الاسنان وغيرها
              </p>
            </div>
          </Carousel.Caption>
        </Carousel.Item>

        <Carousel.Item className="shadow-lg">
          <img className="slider" src={img9} alt="Second slide" />
          <Carousel.Caption>
            <div className=" title">
              تحظى خدمات العلاج بالجامعة بتقدير عالٍ وتحظى بتقدير جيد ، مع
              تقييمات إيجابية من الزائرين الذين شرفونا في عيادات الجامعه لتقديم
              لهم أفضل الخدمات المتوفره لمعالجه أسنانهم. وأيضا توفر مجموعة واسعة
              من دعم لمساعدة الطلاب على النجاح أكاديميا وشخصيا
              <br /> ومن العيادات المتوفره و الخدمات المقدمة
            </div>
            <div className="text2">
              <h4 className="fs-2">عيادات علاج جذور الأسنان </h4>
              <p>
                قناة الجذر هي إحدى الإجراءات الطبية العلاجية في عالم الأسنان.
                يستخدم هذا النوع من العلاج لإنقاذ الأسنان الذي يكاد يتآكل من
                التسوس ، أو لإنقاذ سن تعرض لالتهاب أو ضرر شديد. هذا العلاج
                يستهدف قلب العصب السني الموجود داخل الجذر قناة السن. من مزيج من
                الأعصاب والدم أوعية.
              </p>
            </div>
          </Carousel.Caption>
        </Carousel.Item>

        <Carousel.Item className="shadow-lg">
          <img className="slider" src={img12} alt="Third slide" />
          <Carousel.Caption>
            <div className=" title">
              تحظى خدمات العلاج بالجامعة بتقدير عالٍ وتحظى بتقدير جيد ، مع
              تقييمات إيجابية من الزائرين الذين شرفونا في عيادات الجامعه لتقديم
              لهم أفضل الخدمات المتوفره لمعالجه أسنانهم. وأيضا توفر مجموعة واسعة
              من دعم لمساعدة الطلاب على النجاح أكاديميا وشخصيا
              <br /> ومن العيادات المتوفره و الخدمات المقدمة
            </div>
            <div className="text2">
              <h4 className="fs-2">عيادات طب الأسنان التحفظي</h4>
              <p>
                وهو عملية علاجية يتم من خلالها إزالة الحد الأدنى من بنية الأسنان
                السليمة أثناء عملية الترميم ، هو بطبيعته هدف مرغوب فيه للأسنان.
                لا يزال المينا الطبيعي وعاج الأسنان الطبيعي من أفضل المواد
                الموجودة في طب الأسنان ، وبالتالي يفضل إجراء إجراءات طفيفة
                التوغل للحفاظ على المزيد من بنية الأسنان الصحية الأصلية.
              </p>
            </div>
          </Carousel.Caption>
        </Carousel.Item>

        <Carousel.Item className="shadow-lg">
          <img className="slider" src={img13} alt="Four slide" />
          <Carousel.Caption>
            <div className=" title">
              تحظى خدمات العلاج بالجامعة بتقدير عالٍ وتحظى بتقدير جيد ، مع
              تقييمات إيجابية من الزائرين الذين شرفونا في عيادات الجامعه لتقديم
              لهم أفضل الخدمات المتوفره لمعالجه أسنانهم. وأيضا توفر مجموعة واسعة
              من دعم لمساعدة الطلاب على النجاح أكاديميا وشخصيا
              <br /> ومن العيادات المتوفره و الخدمات المقدمة
            </div>
            <div className="text2">
              <h4 className="fs-2">عيادات أمراض اللثه</h4>
              <p>
                تنجم أمراض اللثة بشكل رئيسي عن التهابات والتهابات اللثة عظام
                التي تحيط بالأسنان وتدعمها. يمكن أن تصبح اللثة منتفخة وحمراء ،
                وقد تنزف. في شكله الأكثر خطورة ، والذي يسمى التهاب دواعم السن
                يمكن أن تبتعد اللثة عن الأسنان، وقد ترتخي الأسنان أو تتساقط
              </p>
            </div>
          </Carousel.Caption>
        </Carousel.Item>

        <Carousel.Item className="shadow-lg">
          <img className="slider" src={img14} alt="Five slide" />
          <Carousel.Caption>
            <div className=" title">
              تحظى خدمات العلاج بالجامعة بتقدير عالٍ وتحظى بتقدير جيد ، مع
              تقييمات إيجابية من الزائرين الذين شرفونا في عيادات الجامعه لتقديم
              لهم أفضل الخدمات المتوفره لمعالجه أسنانهم. وأيضا توفر مجموعة واسعة
              من دعم لمساعدة الطلاب على النجاح أكاديميا وشخصيا
              <br /> ومن العيادات المتوفره و الخدمات المقدمة
            </div>
            <div className="text2">
              <h4 className="fs-2">عيادات الجراحه </h4>
              <p>
                إجراء قد يلجأ إليه الطبيب لإزالة سن لا يمكن إصلاحها باستخدام
                الحشوات أو غيرها من الإجراءات التقليدية، وذلك كما في حالات تعرض
                إحداها لتهشم شديد، أو كونها مدفونة أسفل اللثة، أو بها تشوهات
                أصابت جذرها.
              </p>
            </div>
          </Carousel.Caption>
        </Carousel.Item>

        <Carousel.Item className="shadow-lg">
          <img className="slider" src={img11} alt="Six slide" />
          <Carousel.Caption>
            <div className=" title">
              تحظى خدمات العلاج بالجامعة بتقدير عالٍ وتحظى بتقدير جيد ، مع
              تقييمات إيجابية من الزائرين الذين شرفونا في عيادات الجامعه لتقديم
              لهم أفضل الخدمات المتوفره لمعالجه أسنانهم. وأيضا توفر مجموعة واسعة
              من دعم لمساعدة الطلاب على النجاح أكاديميا وشخصيا
              <br /> ومن العيادات المتوفره و الخدمات المقدمة
            </div>
            <div className="text2">
              <h4 className="fs-2">عيادات التعويضات السنية</h4>
              <p>
                فرع من فروع طب الأسنان مخصص لاستبدال الأسنان المفقودة أو
                التالفة. تشمل علاجات التعويضات السنية الشائعة أطقم الأسنان
                وزراعة الأسنان والتيجان والجسور
              </p>
            </div>
          </Carousel.Caption>
        </Carousel.Item>
      </Carousel>
    </div>
  );
};

export default DentalServices;
